# 1. 함수 매핑
* 함수 매핑 : 시리즈 또는 데이터프레임의 개별 원소를 특정 함수에 일대일 대응시키는 과정

## 1-1. 개별 원소에 함수 매핑
* 시리즈 원소에 함수 매핑 : Series객체.apply(매핑 함수)
* 데이터프레임 원소에 함수 매핑 : DataFrame 객체.applymap(매핑 함수)

In [3]:
# (1) 시리즈 원소에 함수 매핑
# apply() 메소드를 적용하면 시리즈 원소의 개수만큼 리턴값을 받아서 같은 크기의 시리즈 객체로 반환함

import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']]
df['ten'] = 10
print(df.head(), '\n')

# 사용자 함수 정의
def add_10(n): # 10을 더하는 함수
    return n + 10

def add_two_obj(a, b): # 두 객체의 합
    return a + b

# 시리즈 객체에 적용
sr1 = df['age'].apply(add_10)
print(sr1.head(), '\n')

# 시리즈 객체와 숫자에 적용
sr2 = df['age'].apply(add_two_obj, b = 10)
print(sr2.head(), '\n')

# lambda 함수 활용 : 시리즈 객체에 적용
sr3 = df['age'].apply(lambda x: x + 10)
print(sr3.head())

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [5]:
# (2) 데이터프레임 원소에 함수 매핑
# applymap() 메소드를 활용하여 원소의 원래 위치에 매핑 함수의 리턴값을 입력하여 동일한 형태의 데이터프레임이 만들어짐

import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']]
print(df.head(), '\n')

# 사용자 함수 정의
def add_10(n):
    return n + 10

# 데이터프레임에 add_10() 함수를 매핑 적용
df_map = df.applymap(add_10)
print(df_map.head())

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

## 1-2. 시리즈 객체에 함수 매핑
* 데이터프레임의 각 열에 함수 매핑 : DataFrame 객체.apply(매핑 함수, axis = 0)
* 데이터프레임의 각 행에 함수 매핑 : DataFrame 객체.apply(매핑 함수, axis = 1)

In [10]:
# (1) 데이터프레임의 각 열에 함수 매핑 (=> 열 내에서 !)
# apply() 메소드를 적용하면 모든 열을 하나씩 분리하여 매핑 함수의 인자로 각 열(시리즈)이 전달
# 매핑 함수에 따라 반환되는 객체의 종류가 다름

import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']]
print(df.head(), '\n')

# 데이터프레임에 apply 메소드를 적용
result = df.apply(lambda x: x.isnull())
print(result.head(), '\n')

# 이 때

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

     age   fare
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False

이 때 isnull() 함수를 앞에서 배운 데이터프레임의 각 원소에 함수를 매핑하는 applymap()을 사용하면 안되나 ?<br>
=> isnull() 함수는 시리즈 객체에서 누락 데이터를 찾고 그 결과를 불린 시리즈 형태로 반환하는 함수<br>
=> 따라서, 입력 자체를 시리즈로 받기 때문에 applymap()을 사용할 수 없음

In [11]:
import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']]
print(df.head(), '\n')

# 데이터프레임에 apply 메소드를 적용하여 최대값과 최소값의 차이를 계산
result = df.apply(lambda x: x.max() - x.min())
print(result, '\n')

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

age      79.5800
fare    512.3292
dtype: float64

In [15]:
# (2) 데이터프레임의 각 행에 함수 매핑 (=> 행 내에서 !)
# apply() 메소드를 적용하면 데이터프레임의 각 행을 매핑함수의 인자로 전달

import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']]
df['ten'] = 10
print(df.head(), '\n')

# 데이터프레임의 2개 열에 적용
result = df.apply(lambda x: x['age'] + x['fare'], axis = 1)
print(result.head())

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10

0     29.2500
1    109.2833
2     33.9250
3     88.1000
4     43.0500
dtype: float64

## 1-3. 데이터프레임 객체에 함수 매핑
* 데이터프레임 객체에 함수 매핑 : DataFrame 객체.pipe(매핑 함수)

## ■ apply() 실습

In [22]:
import pandas as pd

df = pd.DataFrame({'성별':['남자', '남자', '여자', '남자', '여자', '여자'],
                   '나이':[47, 32, 34, 48, 29, 26],
                   '음주횟수':[2, 2, 6, 6, 2, 0],
                   '직업분류':['사무직', '생산직', '영업직', '영업직', '생산직', '사무직']})

# 1. df에 나이대를 나타내는 '분류1'이라는 변수를 생성하라.

# 방법1
print(df['나이'].describe())

def age(x):
    if x >= 40:
        return '40대'
    elif x >= 30:
        return '30대'
    elif x >= 20:
        return '20대'
    
df['분류1'] = df.나이.apply(lambda x: age(x))

# 방법2
df['분류1'] = df.나이.apply(lambda x: str(x // 10 * 10) + '대')



# 2. df에 나이와 성별을 동시에 나타내는 '분류2'이라는 변수를 생성하라.

# 방법1
df['분류2'] = df.apply(lambda x: x['분류1'][0:2] + x['성별'][0], axis = 1)

# 방법 2
df['분류2'] = df.apply(lambda x: str(x['나이'] // 10 * 10) + x['성별'][0], axis = 1)

df

count     6.000000
mean     36.000000
std       9.316652
min      26.000000
25%      29.750000
50%      33.000000
75%      43.750000
max      48.000000
Name: 나이, dtype: float64

   성별  나이  음주횟수 직업분류  분류1  분류2
0  남자  47     2  사무직  40대  40남
1  남자  32     2  생산직  30대  30남
2  여자  34     6  영업직  30대  30여
3  남자  48     6  영업직  40대  40남
4  여자  29     2  생산직  20대  20여
5  여자  26     0  사무직  20대  20여

# 2. 열 재구성
* 열 순서 변경 : DataFrame 객체[재구성한 열 이름의 리스트]
* 열 분리 / 문자열 리스트 인덱싱 : Series 객체.str.split() / Series 객체.str.get(인덱스)

## 2-1. 열 순서 변경

In [53]:
import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic.loc[0:4, 'survived':'age'] # 파이썬 리스트 슬라이싱과 다르게 마지막 범위의 값이 포함됨
print(df, '\n')

# 열 이름 리스트 만들기
columns = df.columns.values
print(columns, '\n')

# 알파벳 순서로 열 정렬
list_columns = sorted(columns)
df_sorted = df[list_columns]
print(df_sorted, '\n')

# 알파벳 역순서로 열 정렬
reversed_columns = reversed(list_columns)
df_reversed = df[reversed_columns]
print(df_reversed, '\n')

# 열 이름을 사용자가 정의한 임의의 순서로 배치
df_customed = df[['pclass', 'age', 'survived', 'sex']]
print(df_customed, '\n')

   survived  pclass     sex   age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

['survived' 'pclass' 'sex' 'age']

    age  pclass     sex  survived
0  22.0       3    male         0
1  38.0       1  female         1
2  26.0       3  female         1
3  35.0       1  female         1
4  35.0       3    male         0

   survived     sex  pclass   age
0         0    male       3  22.0
1         1  female       1  38.0
2         1  female       3  26.0
3         1  female       1  35.0
4         0    male       3  35.0

   pclass   age  survived     sex
0       3  22.0         0    male
1       1  38.0         1  female
2       3  26.0         1  female
3       1  35.0         1  female
4       3  35.0         0    male

## 2-2. 열 분리

In [57]:
import pandas as pd

df = pd.read_excel('./주가데이터.xlsx', engine = 'openpyxl')
print(df.head(), '\n')
print(df.dtypes, '\n') # '연월일' 열의 자료형이 datetime64

# 연, 월, 일 데이터 분리하기
df['연월일'] = df['연월일'].astype('str') # '연월일' 열의 자료형을 str로 변환
dates = df['연월일'].str.split('-')
print(dates.head(), '\n')

# 분리된 정보를 각각 새로운 열에 담아 df에 추가하기
df['연'] = dates.str.get(0)
df['월'] = dates.str.get(1)
df['일'] = dates.str.get(2)
print(df.head())

         연월일   당일종가  전일종가     시가     고가     저가     거래량
0 2018-07-02  10100   600  10850  10900  10000  137977
1 2018-06-29  10700   300  10550  10900   9990  170253
2 2018-06-28  10400   500  10900  10950  10150  155769
3 2018-06-27  10900   100  10800  11050  10500  133548
4 2018-06-26  10800   350  10900  11000  10700   63039

연월일     datetime64[ns]
당일종가             int64
전일종가             int64
시가               int64
고가               int64
저가               int64
거래량              int64
dtype: object

0    [2018, 07, 02]
1    [2018, 06, 29]
2    [2018, 06, 28]
3    [2018, 06, 27]
4    [2018, 06, 26]
Name: 연월일, dtype: object

          연월일   당일종가  전일종가     시가     고가     저가     거래량     연   월   일
0  2018-07-02  10100   600  10850  10900  10000  137977  2018  07  02
1  2018-06-29  10700   300  10550  10900   9990  170253  2018  06  29
2  2018-06-28  10400   500  10900  10950  10150  155769  2018  06  28
3  2018-06-27  10900   100  10800  11050  10500  133548  2018  06  27
4  2018-06-26  10800   350  10900  11000  10700   63039  2018  06  26

### 앞에서 다루었던 시계열 데이터와 비교해본다면 ?

In [59]:
import pandas as pd

df = pd.read_excel('./주가데이터.xlsx', engine = 'openpyxl')
print(df.head(), '\n')
print(df.dtypes, '\n') # '연월일' 열의 자료형이 datetime64

df['년'] = df['연월일'].dt.year
df['월'] = df['연월일'].dt.month
df['일'] = df['연월일'].dt.day
print(df.head())

         연월일   당일종가  전일종가     시가     고가     저가     거래량
0 2018-07-02  10100   600  10850  10900  10000  137977
1 2018-06-29  10700   300  10550  10900   9990  170253
2 2018-06-28  10400   500  10900  10950  10150  155769
3 2018-06-27  10900   100  10800  11050  10500  133548
4 2018-06-26  10800   350  10900  11000  10700   63039

연월일     datetime64[ns]
당일종가             int64
전일종가             int64
시가               int64
고가               int64
저가               int64
거래량              int64
dtype: object

         연월일   당일종가  전일종가     시가     고가     저가     거래량     년  월   일
0 2018-07-02  10100   600  10850  10900  10000  137977  2018  7   2
1 2018-06-29  10700   300  10550  10900   9990  170253  2018  6  29
2 2018-06-28  10400   500  10900  10950  10150  155769  2018  6  28
3 2018-06-27  10900   100  10800  11050  10500  133548  2018  6  27
4 2018-06-26  10800   350  10900  11000  10700   63039  2018  6  26

# 3. 필터링
* 불린 인덱싱 : DataFrame 객체[불린 시리즈]
* isin() 메소드 활용 : DataFrame의 열 객체.isin(추출 값의 리스트)

## 3-1. 불린 인덱싱
많은 데이터 중에서 어떤 조건을 만족하는 데이터만을 추출하는 필터링 기법의 한 유형

In [6]:
import seaborn as sns

titanic = sns.load_dataset('titanic')

# 나이가 10대인 승객만 따로 선택
mask1 = (titanic['age'] >= 10) & (titanic['age'] <= 19)
df_teenage = titanic.loc[mask1, :]
print('* df_teenage')
print(df_teenage.head(), '\n')

# 나이가 10세 미만(0~9세)이고 여성인 승객만 따로 선택
mask2 = (titanic['age'] < 10) & (titanic['sex'] == 'female')
df_female_under10 = titanic.loc[mask2, :]
print('* df_female_under10')
print(df_female_under10.head(), '\n')

# 나이가 10세 미만(0~9세) 또는 60세 이상인 승객의 age, sex, alone 열만 선택
mask3 = (titanic['age'] < 10) | (titanic['age'] >= 60)
df_under10_morethan60 = titanic.loc[mask3, ['age', 'sex', 'alone']]
print('* df_under10_morethan60')
print(df_under10_morethan60.head())

* df_teenage
    survived  pclass     sex   age  sibsp  parch      fare embarked   class  \
9          1       2  female  14.0      1      0   30.0708        C  Second
14         0       3  female  14.0      0      0    7.8542        S   Third
22         1       3  female  15.0      0      0    8.0292        Q   Third
27         0       1    male  19.0      3      2  263.0000        S   First
38         0       3  female  18.0      2      0   18.0000        S   Third

      who  adult_male deck  embark_town alive  alone
9   child       False  NaN    Cherbourg   yes  False
14  child       False  NaN  Southampton    no   True
22  child       False  NaN   Queenstown   yes   True
27    man        True    C  Southampton    no  False
38  woman       False  NaN  Southampton    no  False

* df_female_under10
     survived  pclass     sex  age  sibsp  parch     fare embarked   class  \
10          1       3  female  4.0      1      1  16.7000        S   Third
24          0       3  female  8.0      3      1  21.0750        S   Third
43          1       2  female  3.0      1      2  41.5792        C  Second
58          1       2  female  5.0      1      2  27.7500        S  Second
119         0       3  female  2.0      4      2  31.2750        S   Third

       who  adult_male deck  embark_town alive  alone
10   child       False    G  Southampton   yes  False
24   child       False  NaN  Southampton    no  False
43   child       False  NaN    Cherbourg   yes  False
58   child       False  NaN  Southampton   yes  False
119  child       False  NaN  Southampton    no  False

* df_under10_morethan60
     age     sex  alone
7    2.0    male  False
10   4.0  female  False
16   2.0    male  False
24   8.0  female  False
33  66.0    male   True

## 3-2. isin() 메소드 활용
데이터프레임의 열에 isin() 메소드를 적용하면 특정 값을 가진 행들을 따로 추출 가능

In [10]:
# titanic 데이터셋의 sibsp 열의 값이 3, 4, 5 중 하나인 행들을 추출
# 불린인덱싱과 isin() 메소드 활용을 비교


# 불린 인덱싱
import seaborn as sns
import pandas as pd

titanic = sns.load_dataset('titanic')

# IPython 디스플레이 설정 변경 - 출력할 최대 열의 개수
pd.set_option('display.max_columns', 10)

# 함께 탑승한 형제 또는 배우자가 3, 4, 5인 승객만 따로 추출 - 불린 인덱싱
mask3 = titanic['sibsp'] == 3
mask4 = titanic['sibsp'] == 4
mask5 = titanic['sibsp'] == 5
df_boolean = titanic[mask3 | mask4 | mask5]
print(df_boolean.head(), '\n')


# isin() 메소드 활용
isin_filter = titanic['sibsp'].isin([3, 4, 5])
df_isin = titanic[isin_filter]
print(df_isin.head())

    survived  pclass     sex   age  sibsp  ...  adult_male  deck  embark_town  \
7          0       3    male   2.0      3  ...       False   NaN  Southampton
16         0       3    male   2.0      4  ...       False   NaN   Queenstown
24         0       3  female   8.0      3  ...       False   NaN  Southampton
27         0       1    male  19.0      3  ...        True     C  Southampton
50         0       3    male   7.0      4  ...       False   NaN  Southampton

   alive  alone
7     no  False
16    no  False
24    no  False
27    no  False
50    no  False

[5 rows x 15 columns]

    survived  pclass     sex   age  sibsp  ...  adult_male  deck  embark_town  \
7          0       3    male   2.0      3  ...       False   NaN  Southampton
16         0       3    male   2.0      4  ...       False   NaN   Queenstown
24         0       3  female   8.0      3  ...       False   NaN  Southampton
27         0       1    male  19.0      3  ...        True     C  Southampton
50         0       3    male   7.0      4  ...       False   NaN  Southampton

   alive  alone
7     no  False
16    no  False
24    no  False
27    no  False
50    no  False

[5 rows x 15 columns]

# 4. 데이터프레임 합치기
* 데이터프레임 연결 : pandas.concat(데이터프레임 리스트) => 행 또는 열 중 어느 한 방향
* 데이터프레임 병합 : pandas.merge(df.left, df.right, how = 'inner', on = None) => SQL의 join 명령과 비슷
* 데이터프레임 결합 : DataFrmae.join(DataFrame2, how = 'left') => merge와 비슷, but 행 인덱스 기준으로 결합

## 4-1. 데이터프레임 연걸
축 방향을 지정하지 않으면 기본 옵션(axis = 0)이 적용되어 위 아래 행 방향으로 연결됨<br>
이 때 각 데이터프레임의 행 인덱스는 본래 형태를 유지<br>
옵션으로 join = 'outer' (합집합), join = 'inner' (교집합)를 사용 가능

In [20]:
import pandas as pd

# 데이터프레임 만들기
df1 = pd.DataFrame({'a':['a0', 'a1', 'a2', 'a3'],
                    'b':['b0', 'b1', 'b2', 'b3'],
                    'c':['c0', 'c1', 'c2', 'c3']},
                    index = [0, 1, 2, 3])

df2 = pd.DataFrame({'a':['a2', 'a3', 'a4', 'a5'],
                    'b':['b2', 'b3', 'b4', 'b5'],
                    'c':['c2', 'c3', 'c4', 'c5'],
                    'd':['d2', 'd3', 'd4', 'd5']},
                    index = [2, 3, 4, 5])

print(df1, '\n')
print(df2, '\n')

# 2개의 데이터프레임을 위 아래 행 방향으로 이어 붙이듯 연결하기
result1 = pd.concat([df1, df2])
print(result1, '\n')

# ignore_index = True 옵션 설정하기
result2 = pd.concat([df1, df2], ignore_index = True) # 정수형 위치 인덱스가 새롭게 설정 (0~7 범위)
print(result2, '\n')

# 2개의 데이터프레임을 좌우 열 방향으로 이어 붙이듯 연결하기
result3 = pd.concat([df1, df2], axis = 1)
print(result3, '\n')

# join = 'inner 옵션 설정'
# 공통으로 존재하는 데이터만을 반환
result3_in = pd.concat([df1, df2], axis = 1,join = 'inner')
print(result3_in)

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3

    a   b   c   d
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
2  a2  b2  c2   d2
3  a3  b3  c3   d3
4  a4  b4  c4   d4
5  a5  b5  c5   d5

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
4  a2  b2  c2   d2
5  a3  b3  c3   d3
6  a4  b4  c4   d4
7  a5  b5  c5   d5

     a    b    c    a    b    c    d
0   a0   b0   c0  NaN  NaN  NaN  NaN
1   a1   b1   c1  NaN  NaN  NaN  NaN
2   a2   b2   c2   a2   b2   c2   d2
3   a3   b3   c3   a3   b3   c3   d3
4  NaN  NaN  NaN   a4   b4   c4   d4
5  NaN  NaN  NaN   a5   b5   c5   d5

    a   b   c   a   b   c   d
2  a2  b2  c2  a2  b2  c2  d2
3  a3  b3  c3  a3  b3  c3  d3

In [24]:
# 데이터프레임과 시리즈, 시리즈와 시리즈를 연결

# 시리즈 만들기
sr1 = pd.Series(['e0', 'e1', 'e2', 'e3'], name = 'e')
sr2 = pd.Series(['f0', 'f1', 'f2'], name = 'f', index = [3, 4, 5])
sr3 = pd.Series(['g0', 'g1', 'g2', 'g3'], name = 'g')

# df1과 sr1을 좌우 열 방향으로 연결하기
result4 = pd.concat([df1, sr1], axis = 1)
print(result4, '\n')

# df2와 sr2을 좌우 열 방향으로 연결하기
result5 = pd.concat([df2, sr2], axis = 1, sort = True)
print(result5, '\n')

# sr1과 sr3을 좌우 열 방향으로 연결하기
result6 = pd.concat([sr1, sr3], axis = 1)
print(result6, '\n')

result7 = pd.concat([sr1, sr3], axis = 0)
print(result7)

    a   b   c   e
0  a0  b0  c0  e0
1  a1  b1  c1  e1
2  a2  b2  c2  e2
3  a3  b3  c3  e3

    a   b   c   d    f
2  a2  b2  c2  d2  NaN
3  a3  b3  c3  d3   f0
4  a4  b4  c4  d4   f1
5  a5  b5  c5  d5   f2

    e   g
0  e0  g0
1  e1  g1
2  e2  g2
3  e3  g3

0    e0
1    e1
2    e2
3    e3
0    g0
1    g1
2    g2
3    g3
dtype: object

## 4-2. 데이터프레임 병합
merge 함수는 SQL의 join 명령과 비슷한 방식으로 어떤 기준에 의해 두 데이터프레임을 병합하는 개념<br>
이 때 기준이 되는 열이나 인덱스를 키(key)라고 부름<br>
키가 되는 열이나 인덱스는 반드시 양쪽 데이터프레임에 모두 존재해야 함

In [27]:
import pandas as pd

# IPython 디스플레이 설정 변경
pd.set_option('display.max_columns', 10) # 출력할 최대 열의 개수
pd.set_option('display.max_colwidth', 20) # 출력할 열의 너비
pd.set_option('display.unicode.east_asian_width', True) # 유니코드 사용 너비 조정

# 데이터프레임 변환
df1 = pd.read_excel('./stock price.xlsx', engine = 'openpyxl')
df2 = pd.read_excel('./stock valuation.xlsx', engine = 'openpyxl')

print(df1, '\n')
print(df2)

       id    stock_name          value   price
0  128940      한미약품   59385.666667  421000
1  130960        CJ E&M   58540.666667   98900
2  138250    엔에스쇼핑   14558.666667   13200
3  139480        이마트  239230.833333  254500
4  142280  녹십자엠에스     468.833333   10200
5  145990        삼양사   82750.000000   82000
6  185750        종근당   40293.666667  100500
7  192400    쿠쿠홀딩스  179204.666667  177500
8  199800          툴젠   -2514.333333  115400
9  204210  모두투어리츠    3093.333333    3475

       id              name           eps     bps        per       pbr
0  130960            CJ E&M   6301.333333   54068  15.695091  1.829178
1  136480              하림    274.166667    3551  11.489362  0.887074
2  138040    메리츠금융지주   2122.333333   14894   6.313806  0.899691
3  139480            이마트  18268.166667  295780  13.931338  0.860437
4  145990            삼양사   5741.000000  108090  14.283226  0.758627
5  161390        한국타이어   5648.500000   51341   7.453306  0.820007
6  181710   NHN엔터테인먼트   2110.166667   78434  30.755864  0.827447
7  185750            종근당   3990.333333   40684  25.185866  2.470259
8  204210      모두투어리츠     85.166667    5335  40.802348  0.651359
9  207940  삼성바이오로직스   4644.166667   60099  89.790059  6.938551

In [28]:
# 데이터프레임 합치기 - (디폴트) 교집합, 공통으로 속하는 모든 열을 기준으로 병합
merge_inner = pd.merge(df1, df2) 
print(merge_inner) # id 기준으로 공통으로 존재하는 5개 종목에 대해 병합되어 출력

       id    stock_name          value   price          name           eps  \
0  130960        CJ E&M   58540.666667   98900        CJ E&M   6301.333333
1  139480        이마트  239230.833333  254500        이마트  18268.166667
2  145990        삼양사   82750.000000   82000        삼양사   5741.000000
3  185750        종근당   40293.666667  100500        종근당   3990.333333
4  204210  모두투어리츠    3093.333333    3475  모두투어리츠     85.166667

      bps        per       pbr
0   54068  15.695091  1.829178
1  295780  13.931338  0.860437
2  108090  14.283226  0.758627
3   40684  25.185866  2.470259
4    5335  40.802348  0.651359

In [29]:
# 데이터프레임 합치기 - 합집합
merge_outer = pd.merge(df1, df2, how = 'outer', on = 'id')
print(merge_outer)

        id    stock_name          value     price              name  \
0   128940      한미약품   59385.666667  421000.0               NaN
1   130960        CJ E&M   58540.666667   98900.0            CJ E&M
2   138250    엔에스쇼핑   14558.666667   13200.0               NaN
3   139480        이마트  239230.833333  254500.0            이마트
4   142280  녹십자엠에스     468.833333   10200.0               NaN
5   145990        삼양사   82750.000000   82000.0            삼양사
6   185750        종근당   40293.666667  100500.0            종근당
7   192400    쿠쿠홀딩스  179204.666667  177500.0               NaN
8   199800          툴젠   -2514.333333  115400.0               NaN
9   204210  모두투어리츠    3093.333333    3475.0      모두투어리츠
10  136480           NaN            NaN       NaN              하림
11  138040           NaN            NaN       NaN    메리츠금융지주
12  161390           NaN            NaN       NaN        한국타이어
13  181710           NaN            NaN       NaN   NHN엔터테인먼트
14  207940           NaN            NaN       NaN  삼성바이오로직스

             eps       bps        per       pbr
0            NaN       NaN        NaN       NaN
1    6301.333333   54068.0  15.695091  1.829178
2            NaN       NaN        NaN       NaN
3   18268.166667  295780.0  13.931338  0.860437
4            NaN       NaN        NaN       NaN
5    5741.000000  108090.0  14.283226  0.758627
6    3990.333333   40684.0  25.185866  2.470259
7            NaN       NaN        NaN       NaN
8            NaN       NaN        NaN       NaN
9      85.166667    5335.0  40.802348  0.651359
10    274.166667    3551.0  11.489362  0.887074
11   2122.333333   14894.0   6.313806  0.899691
12   5648.500000   51341.0   7.453306  0.820007
13   2110.166667   78434.0  30.755864  0.827447
14   4644.166667   60099.0  89.790059  6.938551

In [30]:
# 데이터프레임 합치기 - 왼쪽 데이터프레임 기준, 키 값 분리
merge_left = pd.merge(df1, df2, how = 'left', left_on = 'stock_name', right_on = 'name')
print(merge_left) # 기준 열이 아닌 id의 경우 양쪽 데이터프레임에 모두 존재해서 id_x, id_y와 같이 구분하여 표시

     id_x    stock_name          value   price      id_y          name  \
0  128940      한미약품   59385.666667  421000       NaN           NaN
1  130960        CJ E&M   58540.666667   98900  130960.0        CJ E&M
2  138250    엔에스쇼핑   14558.666667   13200       NaN           NaN
3  139480        이마트  239230.833333  254500  139480.0        이마트
4  142280  녹십자엠에스     468.833333   10200       NaN           NaN
5  145990        삼양사   82750.000000   82000  145990.0        삼양사
6  185750        종근당   40293.666667  100500  185750.0        종근당
7  192400    쿠쿠홀딩스  179204.666667  177500       NaN           NaN
8  199800          툴젠   -2514.333333  115400       NaN           NaN
9  204210  모두투어리츠    3093.333333    3475  204210.0  모두투어리츠

            eps       bps        per       pbr
0           NaN       NaN        NaN       NaN
1   6301.333333   54068.0  15.695091  1.829178
2           NaN       NaN        NaN       NaN
3  18268.166667  295780.0  13.931338  0.860437
4           NaN       NaN        NaN       NaN
5   5741.000000  108090.0  14.283226  0.758627
6   3990.333333   40684.0  25.185866  2.470259
7           NaN       NaN        NaN       NaN
8           NaN       NaN        NaN       NaN
9     85.166667    5335.0  40.802348  0.651359

In [31]:
# 데이터프레임 합치기 - 오른쪽 데이터프레임 기준, 키 값 분리
merge_right = pd.merge(df1, df2, how = 'right', left_on = 'stock_name', right_on = 'name')
print(merge_right)

       id_x    stock_name          value     price    id_y              name  \
0  130960.0        CJ E&M   58540.666667   98900.0  130960            CJ E&M
1       NaN           NaN            NaN       NaN  136480              하림
2       NaN           NaN            NaN       NaN  138040    메리츠금융지주
3  139480.0        이마트  239230.833333  254500.0  139480            이마트
4  145990.0        삼양사   82750.000000   82000.0  145990            삼양사
5       NaN           NaN            NaN       NaN  161390        한국타이어
6       NaN           NaN            NaN       NaN  181710   NHN엔터테인먼트
7  185750.0        종근당   40293.666667  100500.0  185750            종근당
8  204210.0  모두투어리츠    3093.333333    3475.0  204210      모두투어리츠
9       NaN           NaN            NaN       NaN  207940  삼성바이오로직스

            eps     bps        per       pbr
0   6301.333333   54068  15.695091  1.829178
1    274.166667    3551  11.489362  0.887074
2   2122.333333   14894   6.313806  0.899691
3  18268.166667  295780  13.931338  0.860437
4   5741.000000  108090  14.283226  0.758627
5   5648.500000   51341   7.453306  0.820007
6   2110.166667   78434  30.755864  0.827447
7   3990.333333   40684  25.185866  2.470259
8     85.166667    5335  40.802348  0.651359
9   4644.166667   60099  89.790059  6.938551

# 4-3. 데이터프레임 결합
join() 메소드는 merge() 함수를 기반으로 만들어져 기본 작동 방식이 서로 비슷<br>
다만, join() 메소드는 두 데이터프레임의 행 인덱스를 기준으로 결합<br>
하지만 join() 메소드에서도 on = keys 옵션을 설정하면 행 인덱스 대신 다른 열을 기준으로 결합하는 것이 가능

In [32]:
import pandas as pd

# IPython 디스플레이 설정 변경
pd.set_option('display.max_columns', 10) 
pd.set_option('display.max_colwidth', 20)
pd.set_option('display.unicode.east_asian_width', True)

# 주식 데이터를 가져와서 데이터프레임 만들기
df1 = pd.read_excel('./stock price.xlsx', index_col = 'id', engine = 'openpyxl') # id를 행 인덱스로 설정
df2 = pd.read_excel('./stock valuation.xlsx', index_col = 'id', engine = 'openpyxl')

# 데이터프레임 결합(join) - 행 인덱스를 기준으로 결합
df3 = df1.join(df2)
print(df3)

          stock_name          value   price          name           eps  \
id
128940      한미약품   59385.666667  421000           NaN           NaN
130960        CJ E&M   58540.666667   98900        CJ E&M   6301.333333
138250    엔에스쇼핑   14558.666667   13200           NaN           NaN
139480        이마트  239230.833333  254500        이마트  18268.166667
142280  녹십자엠에스     468.833333   10200           NaN           NaN
145990        삼양사   82750.000000   82000        삼양사   5741.000000
185750        종근당   40293.666667  100500        종근당   3990.333333
192400    쿠쿠홀딩스  179204.666667  177500           NaN           NaN
199800          툴젠   -2514.333333  115400           NaN           NaN
204210  모두투어리츠    3093.333333    3475  모두투어리츠     85.166667

             bps        per       pbr
id
128940       NaN        NaN       NaN
130960   54068.0  15.695091  1.829178
138250       NaN        NaN       NaN
139480  295780.0  13.931338  0.860437
142280       NaN        NaN       NaN
145990  108090.0  14.283226  0.758627
185750   40684.0  25.185866  2.470259
192400       NaN        NaN       NaN
199800       NaN        NaN       NaN
204210    5335.0  40.802348  0.651359

In [33]:
# 데이터프레임 결합(join) - 교집합
df4 = df1.join(df2, how = 'inner')
print(df4)

          stock_name          value   price          name           eps  \
id
130960        CJ E&M   58540.666667   98900        CJ E&M   6301.333333
139480        이마트  239230.833333  254500        이마트  18268.166667
145990        삼양사   82750.000000   82000        삼양사   5741.000000
185750        종근당   40293.666667  100500        종근당   3990.333333
204210  모두투어리츠    3093.333333    3475  모두투어리츠     85.166667

           bps        per       pbr
id
130960   54068  15.695091  1.829178
139480  295780  13.931338  0.860437
145990  108090  14.283226  0.758627
185750   40684  25.185866  2.470259
204210    5335  40.802348  0.651359

# 5. 그룹 연산
* 그룹 연산(분할) : DataFrame 객체.groupby(기준이 되는 열)
* 개별 그룹 선택 : group 객체.get_group(그룹명)
* 데이터 집계 : group 객체.집계함수 / group 객체.agg(사용자 정의 함수, 매핑함수)
 * 모든 열에 여러 함수를 매핑 : group 객체.agg({함수1, 함수2, 함수3, ...})
 * 각 열마다 다른 함수를 매핑 : group 객체.agg({'열1':함수1, '열2':함수2, ...})<br>
=> agg() 메소드는 각 그룹별 데이터에 연산을 위한 함수를 구분 적용하고, 그룹별로 연산 결과를 집계하여 반환
* 그룹 연산 데이터 변환 : group 객체.transform(매핑함수)<br>
=> transform() 메소드는 그룹별로 구분하여 각 원소에 함수를 적용하지만 그룹별 집계 대신 각 원소의 본래 행 인덱스와 열 이름을 기준으로 연산 결과를 반환
* 그룹 객체 필터링 : group 객체.filter(조건식 함수)
* 그룹 객체에 함수 매핑 : group 객체.apply(매핑 함수)

## 5-1. 그룹 객체 만들기(분할 단계)
groupby() 메소드는 데이터프레임의 특정 열을 기준으로 데이터프레임을 분할하여 그룹 객체를 반환<br>
기준이 되는 열은 1개도 가능하고, 여러 열을 리스트로 입력할 수도 있음

### 1개 열을 기준으로 그룹화

In [39]:
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'sex', 'class', 'fare', 'survived']]

print('승객 수 :', len(df))
print(df.head(), '\n')

# class 열을 기준으로 분할
grouped = df.groupby(['class'])
print(grouped, '\n')

# 그룹 객체를 iteration으로 출력 : head() 메소드로 첫 5행만을 출력
# 각 승객의 행 인덱스가 그대로 유지됨
for key, group in grouped:
    print('* key :', key)
    print('* number :', len(group))
    print(group.head())
    print('\n')
    
# 그룹별 연산 메소드 적용
average = grouped.mean()
print(average, '\n')

# 개별 그룹 선택
group3 = grouped.get_group('Third')
print(group3.head())

승객 수 : 891
    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000024E4E750E50>

* key : First
* number : 216
     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
6   54.0    male  First  51.8625         0
11  58.0  female  First  26.5500         1
23  28.0    male  First  35.5000         1


* key : Second
* number : 184
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1
20  35.0    male  Second  26.0000         0
21  34.0    male  Second  13.0000         1


* key : Third
* number : 491
    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0


              age       fare  survived
class
First   38.233441  84.154687  0.629630
Second  29.877630  20.662183  0.472826
Third   25.140620  13.675550  0.242363

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0

### 여러 열을 기준으로 그룹화
여러 개의 기준 값을 사용하기 때문에 반환되는 그룹 객체의 인덱스는 다중 구조인 멀티 인덱스(MultiIndex)를 가짐<br>
가능한 조합이 튜플 형식으로 지정됨 (ex) ('First', 'Female')

In [43]:
# class 열, sex 열을 기준으로 분할
grouped_two = df.groupby(['class', 'sex'])

# grouped_two 그룹 객체를 iteration으로 출력
for key, group in grouped_two:
    print('* key :', key)
    print('* number :', len(group))
    print(group.head())
    print('\n')
    
# grouped_two 그룹 객체에 연산 메소드 적용
average_two = grouped_two.mean() # 반환된 데이터프레임의 행 인덱스가 2중 멀티 인덱스
print(average_two, '\n')

# grouped_two 그룹 객체에서 개별 그룹 선택하기
group3f = grouped_two.get_group(('Third', 'female'))
print(group3f.head())

* key : ('First', 'female')
* number : 94
     age     sex  class      fare  survived
1   38.0  female  First   71.2833         1
3   35.0  female  First   53.1000         1
11  58.0  female  First   26.5500         1
31   NaN  female  First  146.5208         1
52  49.0  female  First   76.7292         1


* key : ('First', 'male')
* number : 122
     age   sex  class      fare  survived
6   54.0  male  First   51.8625         0
23  28.0  male  First   35.5000         1
27  19.0  male  First  263.0000         0
30  40.0  male  First   27.7208         0
34  28.0  male  First   82.1708         0


* key : ('Second', 'female')
* number : 76
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
41  27.0  female  Second  21.0000         0
43   3.0  female  Second  41.5792         1
53  29.0  female  Second  26.0000         1


* key : ('Second', 'male')
* number : 108
     age   sex   class  fare  survived
17   NaN  male  Second  13.0         1
20  35.0  male  Second  26.0         0
21  34.0  male  Second  13.0         1
33  66.0  male  Second  10.5         0
70  32.0  male  Second  10.5         0


* key : ('Third', 'female')
* number : 144
     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1
14  14.0  female  Third   7.8542         0
18  31.0  female  Third  18.0000         0


* key : ('Third', 'male')
* number : 347
     age   sex  class     fare  survived
0   22.0  male  Third   7.2500         0
4   35.0  male  Third   8.0500         0
5    NaN  male  Third   8.4583         0
7    2.0  male  Third  21.0750         0
12  20.0  male  Third   8.0500         0


                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1
14  14.0  female  Third   7.8542         0
18  31.0  female  Third  18.0000         0

## 그룹 연산 메소드(적용-결합 단계)

### 데이터 집계
* group 객체.집계함수
* group 객체.agg(매핑함수)

In [36]:
# 데이터 집계
# 집계 기능을 내장하고 있는 판다스 기본 함수 : mean(), max(), min(), sum(), count(), size(), var(), std(), describe(), info(), first(), last()

import pandas as pd
import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'sex', 'class', 'fare', 'survived']]

# class 열을 기준으로 분할
grouped = df.groupby(['class'])

# 각 그룹에 대한 모든 열의 표준편차를 집계하여 데이터프레임으로 변환
std_all = grouped.std()
print(std_all, '\n')

# 각 그룹에 대한 fare 열의 표준편차를 집계하여 시리즈로 변환
std_fare = grouped.fare.std()
print(std_fare, '\n')

              age       fare  survived
class
First   14.802856  78.380373  0.484026
Second  14.001077  13.417399  0.500623
Third   12.495398  11.778142  0.428949

class
First     78.380373
Second    13.417399
Third     11.778142
Name: fare, dtype: float64

In [37]:
# agg() 메소드 집계 : 그룹화된 객체에 각 열에 함수를 적용

def min_max(x): # 최대값 - 최소값
    return x.max() - x.min()

# 각 그룹의 최대값과 최소값 차이를 계산하여 그룹별로 집계
agg_minmax = grouped.agg(min_max)
print(agg_minmax, '\n')

# 여러 함수를 각 열에 동일하게 적용하여 집계
agg_all = grouped.agg(['min', 'max']) 
print(agg_all.head(), '\n') # 함수명을 열 이름에 추가하여 이중 열 구조를 만듦

# 각 열마다 다른 함수를 적용하여 집계
agg_sep = grouped.agg({'fare':['min', 'max'], 'age':'mean'})
print(agg_sep) # 함수명을 열 이름에 추가하여 이중 열 구조를 만듦

          age      fare  survived
class
First   79.08  512.3292         1
Second  69.33   73.5000         1
Third   73.58   69.5500         1

         age           sex       fare           survived
         min   max     min   max  min       max      min max
class
First   0.92  80.0  female  male  0.0  512.3292        0   1
Second  0.67  70.0  female  male  0.0   73.5000        0   1
Third   0.42  74.0  female  male  0.0   69.5500        0   1

       fare                  age
        min       max       mean
class
First   0.0  512.3292  38.233441
Second  0.0   73.5000  29.877630
Third   0.0   69.5500  25.140620

C:\Users\gram\anaconda3\lib\site-packages\pandas\core\groupby\generic.py:303: FutureWarning: Dropping invalid columns in SeriesGroupBy.agg is deprecated. In a future version, a TypeError will be raised. Before calling .agg, select only columns which should be valid for the aggregating function.
  results[key] = self.aggregate(func)

### 그룹 연산 데이터 변환
transform() 메소드는 그룹별로 구분하여 각 함수를 적용한 후, 결과를 반환할 때 본래의 행 인덱스와 열 이름을 기준으로 연산 결과 반환

In [38]:
# z-score을 구하는 과정

# [방법1] 각 그룹별로 z-score을 구해 각 그룹별 결과를 출력

# 그룹별 age 열의 평균 집계 연산
age_mean = grouped.age.mean()
print(age_mean, '\n')

# 그룹별 age 열의 표준편차 집계 연산
age_std = grouped.age.std()
print(age_std, '\n')
print('\n')

# 그룹 객체의 age 열을 iteration으로 z-score를 계산하여 출력
for key, group in grouped.age:
    group_zscore = ( (group - age_mean.loc[key]) / age_std.loc[key])
    print('* key :', key)
    print(group_zscore.head(3))
    print('\n')

class
First     38.233441
Second    29.877630
Third     25.140620
Name: age, dtype: float64

class
First     14.802856
Second    14.001077
Third     12.495398
Name: age, dtype: float64



* key : First
1   -0.015770
3   -0.218434
6    1.065103
Name: age, dtype: float64


* key : Second
9    -1.134029
15    1.794317
17         NaN
Name: age, dtype: float64


* key : Third
0   -0.251342
2    0.068776
4    0.789041
Name: age, dtype: float64

In [39]:
# [방법2] 각 그룹별로 z-score을 구한 후 원래 데이터 형태로 반환

# z-score을 계산하는 사용자 함수 정이ㅡ
def z_score(x):
    return (x - x.mean()) / x.std()

# transform() 메소드를 이용하여 age 열의 데이터를 z-score로 변환
age_zscore = grouped.age.transform(z_score)
print(age_zscore)

0     -0.251342
1     -0.015770
2      0.068776
3     -0.218434
4      0.789041
         ...
886   -0.205529
887   -1.299306
888         NaN
889   -0.826424
890    0.548953
Name: age, Length: 891, dtype: float64

### 그룹 객체 필터링
그룹 객체에 filter() 메소드를 적용할 때 조건식을 가진 `함수`를 전달하면 조건이 참인 그룹만을 남김<br>
본래 데이터의 형태로 추출됨

In [40]:
# 데이터 개수가 200개 이상인 그룹만을 필터링하여 데이터프레임으로 변환
grouped_filter = grouped.filter(lambda x: len(x) >= 200)
print(grouped_filter.head(), '\n') # class가 First, Third인 그룹만 반환
print(type(grouped_filter), '\n')

# age 열의 평균이 30보다 작은 그룹만을 필터링하여 데이터프레임으로 변환
age_filter = grouped.filter(lambda x: x.age.mean() < 30)
print(age_filter.tail(), '\n')
print(type(age_filter), '\n')

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0

<class 'pandas.core.frame.DataFrame'>

      age     sex   class    fare  survived
884  25.0    male   Third   7.050         0
885  39.0  female   Third  29.125         0
886  27.0    male  Second  13.000         0
888   NaN  female   Third  23.450         0
890  32.0    male   Third   7.750         0

<class 'pandas.core.frame.DataFrame'>

### 그룹 객체에 함수 매핑
apply() 함수는 그룹 객체에도 적용 가능

In [41]:
# 집계 : 각 그룹별 요약 통계 정보 집계
agg_grouped = grouped.apply(lambda x: x.describe())
print(agg_grouped, '\n')

# z-score을 계산하는 사용자 함수 정의
def z_score(x):
    return (x - x.mean()) / x.std()

age_zscore = grouped.age.apply(z_score)
print(age_zscore, '\n')

# 필터링 : age 열의 데이터 평균이 30보다 작은 그룹만을 필터링하여 출력
age_filter = grouped.apply(lambda x: x.age.mean() < 30)
print(age_filter, '\n')

for x in age_filter.index:
    if age_filter[x] == True:
        age_filter_df = grouped.get_group(x)
        print(age_filter_df.head(), '\n')

                     age        fare    survived
class
First  count  186.000000  216.000000  216.000000
       mean    38.233441   84.154687    0.629630
       std     14.802856   78.380373    0.484026
       min      0.920000    0.000000    0.000000
       25%     27.000000   30.923950    0.000000
       50%     37.000000   60.287500    1.000000
       75%     49.000000   93.500000    1.000000
       max     80.000000  512.329200    1.000000
Second count  173.000000  184.000000  184.000000
       mean    29.877630   20.662183    0.472826
       std     14.001077   13.417399    0.500623
       min      0.670000    0.000000    0.000000
       25%     23.000000   13.000000    0.000000
       50%     29.000000   14.250000    0.000000
       75%     36.000000   26.000000    1.000000
       max     70.000000   73.500000    1.000000
Third  count  355.000000  491.000000  491.000000
       mean    25.140620   13.675550    0.242363
       std     12.495398   11.778142    0.428949
       min      0.420000    0.000000    0.000000
       25%     18.000000    7.750000    0.000000
       50%     24.000000    8.050000    0.000000
       75%     32.000000   15.500000    0.000000
       max     74.000000   69.550000    1.000000

0     -0.251342
1     -0.015770
2      0.068776
3     -0.218434
4      0.789041
         ...
886   -0.205529
887   -1.299306
888         NaN
889   -0.826424
890    0.548953
Name: age, Length: 891, dtype: float64

class
First     False
Second     True
Third      True
dtype: bool

     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1
20  35.0    male  Second  26.0000         0
21  34.0    male  Second  13.0000         1

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0

## ■ groupby() 실습

In [42]:
import pandas as pd

df = pd.read_csv("https://raw.githubusercontent.com/"
                 "panda-kim/pandas/main/groupby01.csv")
print(df)

# 마트의 매출 데이터를 이용해 일별 제품매출 데이터를 만들어라.

grouped = df.groupby(['매출일자', '상품명'])
group_df = grouped['수량', '판매금액'].sum()
group_df = group_df.reset_index()
print(group_df)

            매출일자          상품명  수량   판매금액
0     2021-02-01    무농약진주설향딸기   1  10900
1     2021-02-01      무농약한판딸기   1   9900
2     2021-02-01  스미후루순유기농바나나   1   3500
3     2021-02-01  유기농체다슬라이스치즈   1   6800
4     2021-02-01       제주마음우유   1   3400
...          ...          ...  ..    ...
4991  2021-02-28        무농약이상   1   2300
4992  2021-02-28    농가상생못난이사과   1   8900
4993  2021-02-28        무농약깻잎   2   2800
4994  2021-02-28      무농약한판딸기   1   8900
4995  2021-02-28       얼큰통밀라면   1   1190

[4996 rows x 4 columns]
            매출일자         상품명  수량   판매금액
0     2021-02-01      21곡초코롤   3   5224
1     2021-02-01   갈아만든슬러시딸기   1   1299
2     2021-02-01        감자라면  28  40000
3     2021-02-01       건치약포미   2   7600
4     2021-02-01         경주빵   1   3383
...          ...         ...  ..    ...
3076  2021-02-28  통째로짜낸오렌지1L   1   8800
3077  2021-02-28     통째로짜낸자몽   6  10800
3078  2021-02-28     통째로짜낸포도   3   5400
3079  2021-02-28        해물한끼   1   1800
3080  2021-02-28      현미대롱강정   1   2000

[3081 rows x 4 columns]

C:\Users\gram\AppData\Local\Temp/ipykernel_28228/2815687137.py:10: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  group_df = grouped['수량', '판매금액'].sum()

# 6. 멀티 인덱스

In [45]:
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'sex', 'class', 'fare', 'survived']]

# class 열, sex 열을 기준으로 분할
grouped = df.groupby(['class', 'sex'])

# 그룹 객체에 연산 메소드 적용
gdf = grouped.mean()
print(gdf, '\n') # 멀티인덱스를 가진 데이터프레임이 반환
print(type(gdf))

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

<class 'pandas.core.frame.DataFrame'>

### 멀티 인덱스에서 하나의 인덱스만 사용하는 방법
* loc 인덱서 사용
* xs 인덱서 사용 : level 옵션 사용

In [51]:
# 1. loc 인덱서 사용

# class 값이 First인 행을 선택하여 출력
print(gdf.loc['First'], '\n')

# class 값이 First이고, sex 값이 female인 행을 선택하여 출력
print(gdf.loc[('First', 'female')], '\n')


# 2. xs 인덱서 사용
print(gdf.xs('male', level = 'sex'))

              age        fare  survived
sex
female  34.611765  106.125798  0.968085
male    41.281386   67.226127  0.368852

age          34.611765
fare        106.125798
survived      0.968085
Name: (First, female), dtype: float64

              age       fare  survived
class
First   41.281386  67.226127  0.368852
Second  30.740707  19.741782  0.157407
Third   26.507589  12.661633  0.135447

# 7. 피벗
* 판다스 pivot_table() 함수는 엑셀에서 사용하는 피벗테이블과 비슷한 기능을 처리
* 피벗테이블을 구성하는 4가지 요소
 * 행 인덱스
 * 열 인덱스
 * 데이터 값
 * 데이터 집계 함수

In [54]:
import pandas as pd
import seaborn as sns

# IPython 디스플레이 설정 변경
pd.set_option('display.max_columns', 10) # 출력할 최대 열의 개수
pd.set_option('display.max_colwidth', 20) # 출력할 열의 너비

titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'sex', 'class', 'fare', 'survived']]
print(df.head(), '\n')

# 행, 열, 값, 집계에 사용할 열을 1개씩 지정 - 평균 집계
pdf1 = pd.pivot_table(df, # 피벗할 데이터프레임
                      index = 'class', # 행 위치에 들어갈 열
                      columns = 'sex', # 열 위치에 들어갈 열
                      values = 'age', # 데이터로 사용할 열
                      aggfunc = 'mean') # 데이터 집계함수

print(pdf1.head())

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0

sex        female       male
class
First   34.611765  41.281386
Second  28.722973  30.740707
Third   21.750000  26.507589

In [55]:
# 값에 적용하는 집계 함수 2개 이상 지정 가능 - 생존율, 생존자 수 집계
pdf2 = pd.pivot_table(df,
                      index = 'class',
                      columns = 'sex',
                      values = 'survived',
                      aggfunc = ['mean', 'sum'])
print(pdf2.head()) # 데이터 집계함수 -> 열의 값 순서로 열 구조 층을 이룸

            mean              sum
sex       female      male female male
class
First   0.968085  0.368852     91   45
Second  0.921053  0.157407     70   17
Third   0.500000  0.135447     72   47

In [57]:
# 행, 열, 값에 사용할 열을 2개 이상 지정 가능 - 평균 나이, 최대 요금 집계
pdf3 = pd.pivot_table(df,
                      index = ['class', 'sex'],
                      columns = 'survived',
                      values = ['age', 'fare'],
                      aggfunc = ['mean', 'max'])

# IPython Console 디스플레이 옵션 설정
pd.set_option('display.max_columns', 10)
print(pdf3.head(), '\n') # 데이터 집계함수 -> 데이터 값 -> 열의 값 순서로 열 구조 층을 이룸

                    mean                                      max        \
                     age                   fare               age
survived               0          1           0           1     0     1
class  sex
First  female  25.666667  34.939024  110.604167  105.978159  50.0  63.0
       male    44.581967  36.248000   62.894910   74.637320  71.0  80.0
Second female  36.000000  28.080882   18.250000   22.288989  57.0  55.0
       male    33.369048  16.022000   19.488965   21.095100  70.0  62.0
Third  female  23.818182  19.329787   19.773093   12.464526  48.0  63.0


                 fare
survived            0         1
class  sex
First  female  151.55  512.3292
       male    263.00  512.3292
Second female   26.00   65.0000
       male     73.50   39.0000
Third  female   69.55   31.3875

In [64]:
# xs 인덱서 사용 - 행 선택(axis = 0, 디폴트)
print(pdf3.xs('First'), '\n') # 행 인덱스가 First인 행을 선택

print(pdf3.xs(('First', 'female')), '\n') # 행 인덱스가 ('First', 'female')인 행을 선택

print(pdf3.xs('female', level = 'sex'), '\n') # 행 인덱스의 sex 레벨이 female인 행을 선택

print(pdf3.xs(('Second', 'male'), level = [0, 'sex']), '\n') # Second, male인 행을 선택 

# xs 인덱서 사용 - 열 선택(axis = 1 설정)
print(pdf3.xs('mean', axis = 1)) # 열 인덱스가 mean인 데이터를 선택

print(pdf3.xs(('mean', 'age'), axis = 1)) # 열 인덱스가 ('mean', 'age')인 데이터 선택

print(pdf3.xs(('max', 'fare', 0), level = [0, 1, 2], axis = 1)) # 열 인덱스가 max, fare, survived = 0인 데이터 선택

               mean                                      max                \
                age                   fare               age          fare
survived          0          1           0           1     0     1       0
sex
female    25.666667  34.939024  110.604167  105.978159  50.0  63.0  151.55
male      44.581967  36.248000   62.894910   74.637320  71.0  80.0  263.00



survived         1
sex
female    512.3292
male      512.3292

            survived
mean  age   0            25.666667
            1            34.939024
      fare  0           110.604167
            1           105.978159
max   age   0            50.000000
            1            63.000000
      fare  0           151.550000
            1           512.329200
Name: (First, female), dtype: float64

               mean                                      max                \
                age                   fare               age          fare
survived          0          1           0           1     0     1       0
class
First     25.666667  34.939024  110.604167  105.978159  50.0  63.0  151.55
Second    36.000000  28.080882   18.250000   22.288989  57.0  55.0   26.00
Third     23.818182  19.329787   19.773093   12.464526  48.0  63.0   69.55



survived         1
class
First     512.3292
Second     65.0000
Third      31.3875

                  mean                               max
                   age               fare            age        fare
survived             0       1          0        1     0     1     0     1
class  sex
Second male  33.369048  16.022  19.488965  21.0951  70.0  62.0  73.5  39.0

                     age                   fare
survived               0          1           0           1
class  sex
First  female  25.666667  34.939024  110.604167  105.978159
       male    44.581967  36.248000   62.894910   74.637320
Second female  36.000000  28.080882   18.250000   22.288989
       male    33.369048  16.022000   19.488965   21.095100
Third  female  23.818182  19.329787   19.773093   12.464526
       male    27.255814  22.274211   12.204469   15.579696
survived               0          1
class  sex
First  female  25.666667  34.939024
       male    44.581967  36.248000
Second female  36.000000  28.080882
       male    33.369048  16.022000
Third  female  23.818182  19.329787
       male    27.255814  22.274211
                  max
                 fare
survived            0
class  sex
First  female  151.55
       male    263.00
Second female   26.00
       male     73.50
Third  female   69.55
       male     69.55